[]
=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa

[MACROEDIT]
//編程主選單=
lb_GameDirectory_OME->Caption=选用游戏
GameManagement=游戏管理
GameManagement_Select=选用游戏夹
GameManagement_New=新建游戏夹
GameManagement_Modify=游戏夾改名
GameManagement_Delete=删除游戏夾
FileManagement=导入/导出
FileManagement_New=新建宏
FileManagement_Open=打开宏
FileManagement_Save=保存宏
FileManagement_SaveAs=另存宏
FileManagement_Delete=删除宏
FileManagement_ReName=重命名
FileManagement_Transfer=上传/下载
lb_FileName_OME->Caption=文件
//編程程式區=
rb_Loop_OME->Caption=循环
rb_Keyboard_OME->Caption=按键
rb_If_OME->Caption=如果
rb_Equal_OME->Caption=等于
lb_SRSectionReteatText1_OME->Caption=起始行
lb_SRSectionReteatText2_OME->Caption=~
lb_SRSectionReteatText3_OME->Caption=终止行,
lb_SRSectionReteatText4_OME->Caption=重复次数
lb_SR_OME->Caption=~
lb_GotoText_OME->Caption=跳跃前往第
lb_LineText_OME->Caption=行
lb_KeyIfText_OME->Caption=如果
lb_KeyStateIsText_OME->Caption=的状态是
lb_KeyThenGotoText_OME->Caption=就跳到第
lb_KeyLineText_OME->Caption=行
lb_IfText1_OME->Caption=如果
lb_IfThenGoto1_OME->Caption=就跳到第
lb_IfLineText1_OME->Caption=行
lb_IfText2_OME->Caption=如果
lb_IfThenGoto2_OME->Caption=就跳到第
lb_IfLineText2_OME->Caption=行
cb_Key_OME->Items->Strings[0]=按键1
cb_Key_OME->Items->Strings[1]=按键2
cb_Key_OME->Items->Strings[2]=按键3
cb_Key_OME->Items->Strings[3]=按键4
cb_Key_OME->Items->Strings[4]=按键5
cb_Key_OME->Items->Strings[5]=按键6
cb_Key_OME->Items->Strings[6]=按键7
cb_Key_OME->Items->Strings[7]=按键8
cb_Key_OME->Items->Strings[8]=按键9
cb_Key_OME->Items->Strings[9]=按键10
cb_Key_OME->Items->Strings[10]=按键11
cb_Key_OME->Items->Strings[11]=按键12
cb_Key_OME->Items->Strings[12]=按键13
cb_Key_OME->Items->Strings[13]=按键14
cb_Key_OME->Items->Strings[14]=按键15
cb_Key_OME->Items->Strings[15]=按键16
cb_Key_OME->Items->Strings[16]=按键17
cb_Key_OME->Items->Strings[17]=按键18
cb_Key_OME->Items->Strings[18]=按键19
cb_Key_OME->Items->Strings[19]=按键20
cb_Key_OME->Items->Strings[20]=按键21
cb_Key_OME->Items->Strings[21]=按键22
cb_Key_OME->Items->Strings[22]=按键23
cb_Key_OME->Items->Strings[23]=按键24
cb_KeyState_OME->Items->Strings[0]=按下
cb_KeyState_OME->Items->Strings[1]=未按下
cb_IfSign1_OME->Items->Strings[0]=等同
cb_IfSign1_OME->Items->Strings[1]=不等同
cb_IfSign2_OME->Items->Strings[0]=等同
cb_IfSign2_OME->Items->Strings[1]=不等同
Var->Items->Strings[0]=变数A
Var->Items->Strings[1]=变数B
Var->Items->Strings[2]=变数C
Var->Items->Strings[3]=变数D
//時間控制區=
lb_KeyDownAutoDelay_OME->Caption=按键按下,插入延迟
lb_KeyUpAutoDelay_OME->Caption=按键放开,插入延迟
lb_TimeUnit_OME->Caption=单位
cb_TimeType_OME->Items->Strings[0]=秒
cb_TimeType_OME->Items->Strings[1]=毫秒
cb_TimeType_OME->Items->Strings[2]=分
lb_Time_OME->Caption=时间
//滑鼠控制區=
lb_AbsPos_OME->Caption=鼠标绝对移动坐标(X,Y)
lb_AbsPos_OME->Hint=可以按住右边的雷达图标, 并移动到屏幕上任何位置, 来取得屏幕的坐标
lb_RelativePos_OME->Caption=鼠标相对移动坐标(X,Y)
bt_WheelUp_OME->Caption=前滚
bt_WheelDown_OME->Caption=后滚
bt_MouseLeftKey_OME->Caption=左键
bt_MouseRightKey_OME->Caption=右键
bt_MouseMidKey_OME->Caption=中键
bt_Mouse4thKey_OME->Caption=四键
bt_Mouse5thKey_OME->Caption=五键
im_CursorPoint_OME->Hint=可以按住此雷达图标, 并移动到屏幕上任何位置, 来取得屏幕的坐标
//編程工具列=
rb_RepeatType_OME->Hint=不重复执行
rb_RepeatType1_OME->Hint=按下:执行@RETURN@弹起:终止执行
rb_RepeatType2_OME->Hint=按下:执行@RETURN@再按:终止执行
bt_Save_OME->Hint=保存
bt_Undo_OME->Hint=撤销
bt_Redo_OME->Hint=恢复
bt_Cut_OME->Hint=剪下
bt_Copy_OME->Hint=复制
bt_Paste_OME->Hint=粘贴
bt_MoveDown_OME->Hint=向下移动
bt_MoveUp_OME->Hint=向上移动
bt_Delete_OME->Hint=删除
bt_Record_OME->Hint=录制
//編程Popup視窗=
mi_Cut_OME->Caption=剪下
mi_CutSingleLine_OME->Caption=剪下单行
mi_CutMultiLine_OME->Caption=剪下多行
mi_Copy_OME->Caption=复制
mi_CopySingleLine_OME->Caption=复制单行
mi_CopyMultiLine_OME->Caption=复制多行
mi_Paste_OME->Caption=粘贴
mi_MoveDown_OME->Caption=向下移动
mi_MoveUp_OME->Caption=向上移动
mi_Editline_OME->Caption=编辑此行
mi_Delete_OME->Caption=删除
mi_DeleteSingleLine_OME->Caption=删除单行
mi_DeleteMultiLine_OME->Caption=删除多行
mi_ClearAllDelay_OME->Caption=清除所有 "延时"
mi_ClearAll_OME->Caption=全部清除
bt_ResumeMacroII_OME->Caption=返回 [奥斯卡II]
bt_DownloadExplain_OME->Caption=下载教程
GoWhile=第 %x 行至此行, 重复执行 %y 次
IfYes=如果 变量%x 等同 %y 就跳到第 %z 行
IfNo=如果 变量%x 不等同 %y 就跳到第 %z 行
IfYes2=如果 变量%x 等同 变量%y 就跳到第 %z 行
IfNo2=如果 变量%x 不等同 变量%y 就跳到第 %z 行
Equ=变数%x @equ@ %y
Equ2=变量%x @equ@ 变量%y
Equ3_0=变量%x @equ@ 变量%y + %z
Equ3_1=变量%x @equ@ 变量%y - %z
Equ3_2=变量%x @equ@ 变量%y & %z
Equ3_3=变量%x @equ@ 变量%y | %z
Equ3_4=变量%x @equ@ 变量%y ^ %z
Goto=前往第 %x 行
IfKeyDown=如果 按键 %x 的状态是 "按住" 就跳到第 %y 行
IfKeyUp=如果 按键 %x 的状态是 "未按住" 就跳到第 %y 行
Key=键
KeyDown=按下
KeyUp=弹起
MouseMoveTo=鼠标移到
MouseRelativeMove=鼠标相对移动
Delay=延时
millisecond=毫秒
second=秒
minute=分
MouseWhellUp=滚轮前滚
MouseWhellDown=滚轮后滚
MouseLeftKeyDown=左键按下
MouseLeftKeyUp=左键弹起
MouseLeftKeyClick=左键单击
MouseLeftKeyDblClick=左键双击
MouseMiddleKeyDown=中键按下
MouseMiddleKeyUp=中键弹起
MouseMiddleKeyClick=中键单击
MouseRightKeyDown=右键按下
MouseRightKeyUp=右键弹起
MouseRightKeyClick=右键单击
MouseFourthKeyDown=四键按下
MouseFourthKeyUp=四键弹起
MouseFourthKeyClick=四键单击
MouseFifthKeyDown=五键按下
MouseFifthKeyUp=五键弹起
MouseFifthKeyClick=五键单击
PleaseInputMacroName=输入文件
SaveOK=储存完成
MacroUsed=文件/目录已被应用至鼠标内存中, 是否要删除/重命名? 如选[是]该功能将移除!
GoWhileRangeError=插入的区间目前不存在
InputDigitError=请输入数字!
VersionMessage=现为赏析版, 无法储存修改信息!
LoopLimit=巢状回圈不可超过3层
NullMacro=空白
PleaseCreateDirectory=请先建立游戏文件夹!
DirectoryUsed=档案/目录已被应用至所有核心的鼠标内存中, 是否要删除/重命名? 如选[是]该功能将移除!
TrialAccessDeny=血手宝典赏析版!@RETURN@无法应用请购买特血核心3激活码@RETURN@(本软件限用血手V或 R系列鼠标!)
IsCoverSameNameFile=储存的档名有跟 [奥斯卡II] 同名，是否覆盖同名档案？
CPIRemarkDefault=预设
//按鍵測試區=
lb_MouseKeyTest_OME->Caption=按键查询
PleasePressKey=请按下鼠标按键
MouseKeyUnknown=无法辨识

[MACROEDIT_Record]
bt_Start->Caption=[F11] 开始
bt_Stop->Caption=[F12] 停止
cb_AxisAbsolute->Caption=录制鼠标绝对移动轨迹
cb_AxisRelatively->Caption=录制鼠标相对移动轨迹
cb_KeyboardAction->Caption=录制键盘操作
cb_MouseClick->Caption=录制鼠标点击
Script3=//下面是您录制的编程!
Script4=//修改编程的方法有三种
Script5=//1. 藉由左方或下方的编辑面板来操作
Script6=//2. 直接在此作键盘输入
Script7=//3. 使用上方的录制功能, 录制剧本

[MACROEDIT_Statement]
lb_Title->Caption=储存前[功能注解]须填写!
lb_Software->Caption=适用软件
lb_Statement->Caption=功能说明
lb_Comment->Caption=动作描述
mi_EditerCut->Caption=剪下     Ctrl+X
mi_EditerCopy->Caption=复制     Ctrl+C
mi_EditerPaste->Caption=粘贴     Ctrl+P
lb_EditComment->Caption1=填写注解
lb_EditComment->Caption2=编辑注解
lb_Resolution->Caption=游戏分辨率
lb_CPIRemark->Caption=灵敏度

[MACROEDIT_Instructions]
lb_TestDescription->Caption=数据暂存于鼠标第四键内存中，进入测试区或游戏中测试，欲回复原第四键设定，请至[按键]页重新设定
ck_CursorRecord->Caption=启动光标录制
lb_InterruptTips->Caption=测试编程无法停止时，则同时按下键盘[Caps Lock]、[Scroll Lock]、[Num Lock]键即可中断功能，然后检查编程
lb_TestCommon->Caption=测试说明
PressSpaceToTest=请按下第四键开始进行测试

[MACROEDIT_ShowIfMessage]
MacroExistAlready=文件已存在，是否替换原文件?
MacroModify=已修改, 要储存吗?
MacroNewCreate=是否建立新文件?
MacroDeleteFile=是否删除选定的文件?
MacroSelectFile=文件/目录已被应用至鼠标内存中, 是否要删除/重命名? 如选[是]该功能将移除!
MacroDeleteDirectory=是否删除此游戏夹?@RETURN@目录包含的档案也将一并删除!!
PleaseCreateDirectory=建立游戏
InputNameExists=文件已存在, 请更新文件名!
MustCreatFile=必须新建宏档案才可编辑!
InputNameInvalid=输入名称不正确! 存在特殊字符[ \ / : * ? " < > | ].

[MACROEDIT_InputBoxX]
lb_NewFileName->Caption=输入档名
lb_ReName->Caption1=重命名
lb_ReName->Caption2=新建宏文件
lb_ReName->Caption3=新建游戏夾
NewCreateGameName=新建游戏夹
NewCreateFileName=新建文件名

[MACROEDIT_Dialog]
lb_Directory->Caption=游戏
lb_FileName->Caption=文件
lb_Title->Caption1=新建宏
lb_Title->Caption2=打开宏
lb_Title->Caption3=保存宏
lb_Title->Caption4=另存宏
lb_Title->Caption5=删除宏
lb_Title->Caption6=重命名
lb_FileType->Caption=类型
advcb_FileType->Caption1=所有宏檔 *.*
advcb_FileType->Caption2=*.amc - 供按键区使用
advcb_FileType->Caption3=*.mgn - 宏枪格式供左键使用
NoAuthorityUse=权限不足，无法打开档案

[MACROEDIT_SelectLine]
lb_SelectLineRange->Caption=选择行数(范围)

